{
	"modelTopology": {
		"class_name": "Sequential",
		"config": [
			{
				"class_name": "Dense",
				"config": {
					"units": 64,
					"activation": "relu",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "VarianceScaling",
						"config": {
							"scale": 1,
							"mode": "fan_avg",
							"distribution": "normal",
							"seed": null
						}
					},
					"bias_initializer": { "class_name": "Zeros", "config": {} },
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"name": "dense_Dense1",
					"trainable": true,
					"batch_input_shape": [null, 4],
					"dtype": "float32"
				}
			},
			{
				"class_name": "Dense",
				"config": {
					"units": 128,
					"activation": "relu",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "VarianceScaling",
						"config": {
							"scale": 1,
							"mode": "fan_avg",
							"distribution": "normal",
							"seed": null
						}
					},
					"bias_initializer": { "class_name": "Zeros", "config": {} },
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"name": "dense_Dense2",
					"trainable": true
				}
			},
			{
				"class_name": "Dense",
				"config": {
					"units": 2,
					"activation": "linear",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "VarianceScaling",
						"config": {
							"scale": 1,
							"mode": "fan_avg",
							"distribution": "normal",
							"seed": null
						}
					},
					"bias_initializer": { "class_name": "Zeros", "config": {} },
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"name": "dense_Dense3",
					"trainable": true
				}
			}
		],
		"keras_version": "tfjs-layers 1.0.0",
		"backend": "tensor_flow.js"
	},
	"format": "layers-model",
	"generatedBy": "TensorFlow.js tfjs-layers v1.0.0",
	"convertedBy": null,
	"weightsManifest": [
		{
			"paths": ["my-model-e3.weights.bin?raw=true"],
			"weights": [
				{ "name": "dense_Dense1/kernel", "shape": [4, 64], "dtype": "float32" },
				{ "name": "dense_Dense1/bias", "shape": [64], "dtype": "float32" },
				{
					"name": "dense_Dense2/kernel",
					"shape": [64, 128],
					"dtype": "float32"
				},
				{ "name": "dense_Dense2/bias", "shape": [128], "dtype": "float32" },
				{
					"name": "dense_Dense3/kernel",
					"shape": [128, 2],
					"dtype": "float32"
				},
				{ "name": "dense_Dense3/bias", "shape": [2], "dtype": "float32" }
			]
		}
	]
}
